-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Окт 10 2022 г., 23:21
-- Версия сервера: 8.0.30
-- Версия PHP: 8.1.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `taskforce2`
--

-- --------------------------------------------------------

--
-- Структура таблицы `cities`
--

CREATE TABLE `cities` (
  `id` int NOT NULL,
  `name` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `latitude` varchar(255) NOT NULL,
  `longitude` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Дамп данных таблицы `cities`
--

INSERT INTO `cities` (`id`, `name`, `latitude`, `longitude`) VALUES
(1, 'Абаза', '52.6517296', '90.0885929'),
(2, 'Абакан', '53.7223661', '91.4437792'),
(3, 'Абдулино', '53.6778096', '53.6473115'),
(4, 'Абинск', '44.8679931', '38.1618437'),
(5, 'Агидель', '55.89976', '53.9221149'),
(6, 'Агрыз', '56.5232645', '52.994257'),
(7, 'Адыгейск', '44.8783715', '39.190172'),
(8, 'Азнакаево', '54.8599054', '53.0745505'),
(9, 'Азов', '47.1120631', '39.4232597'),
(10, 'Ак-Довурак', '51.1785658', '90.5984511'),
(11, 'Аксай', '47.2676075', '39.8755485'),
(12, 'Алагир', '43.0416151', '44.2198622'),
(13, 'Алапаевск', '57.8475542', '61.6693934'),
(14, 'Алатырь', '54.8398179', '46.5721423'),
(15, 'Алдан', '58.6094885', '125.3816689'),
(16, 'Алейск', '52.4920914', '82.7794145'),
(17, 'Александров', '56.3919652', '38.711035'),
(18, 'Александровск', '59.1613773', '57.5764851'),
(19, 'Александровск-Сахалинский', '50.8973664', '142.1579322'),
(20, 'Алексеевка', '50.6299932', '38.6881776'),
(21, 'Алексин', '54.5083788', '37.047891'),
(22, 'Алзамай', '55.5550493', '98.6644106'),
(23, 'Алушта', '44.6764419', '34.4100387'),
(24, 'Альметьевск', '54.9013662', '52.2970654'),
(25, 'Амурск', '50.2345017', '136.8791135'),
(26, 'Анадырь', '64.7314347', '177.5015752'),
(27, 'Анапа', '44.8950777', '37.3163142'),
(28, 'Ангарск', '52.5448102', '103.8885385'),
(29, 'Андреаполь', '56.6507072', '32.2621196'),
(30, 'Анжеро-Судженск', '56.0787179', '86.0202207'),
(31, 'Анива', '46.7132526', '142.5265052'),
(32, 'Апатиты', '67.5678295', '33.4067218'),
(33, 'Апрелевка', '55.5276336', '37.0651105'),
(34, 'Апшеронск', '44.4585239', '39.7300092'),
(35, 'Арамиль', '56.6945341', '60.8343825');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `cities`
--
ALTER TABLE `cities`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `cities`
--
ALTER TABLE `cities`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
